{"paper_key": "castricato_fabula_2021", "file": "content/05_results.typ", "line_or_snippet": "line 21: …quality, coherence, and plausibility…", "why_here": "This line establishes coherence as an evaluation dimension; FEI provides an objective coherence metric via reader-answer entropy (EWC/ETC), directly supporting measurement claims.", "insertion": "Therefore, our analysis focuses not just on the outcomes of the games, but also on the quality, coherence [@castricato_fabula_2021], and plausibility of the language the AI agents use.", "fallback": "Alternatively, cite after 'coherence' when first defining evaluation dimensions elsewhere if this sentence moves."}
{"paper_key": "balloch_NovGridFlexibleGrid_2022", "file": "content/02_background.typ", "line_or_snippet": "line 43: These AI techniques can be powerful solvers…", "why_here": "NovGrid formalizes 'novelty' and provides adaptation metrics, substantiating the claim about limited generalization to novel scenarios.", "insertion": "These AI techniques can be powerful solvers but at the expense of generalization to novel scenarios [@balloch_NovGridFlexibleGrid_2022].", "fallback": "If line wrapping changes, anchor on the sentence ending with 'novel scenarios'."}
{"paper_key": "zollicoffer_NoveltyDetectionReinforcement_2025", "file": "content/09_future_work.typ", "line_or_snippet": "line 4: …robust world models for dynamic environments.", "why_here": "Shows a practical KL-bound signal for novelty in world models, providing a concrete reliability/adaptation trigger in dynamic environments.", "insertion": "Widespread language model deployment in open-ended wargaming scenarios necessitates incorporating sophisticated planning algorithms for long-term strategy in large state spaces, improved counterfactual reasoning for creative strategy generation, and robust world models for dynamic environments [@zollicoffer_NoveltyDetectionReinforcement_2025].", "fallback": "If rephrased, place citation immediately after the phrase 'world models for dynamic environments'."}
{"paper_key": "smith_memory_2021", "file": "content/06_discussion.typ", "line_or_snippet": "line 31: Artifact capture (transcripts, proposals, dissent notes)…", "why_here": "Treating ambient, unlabeled environment data as a 'replay buffer' supports incremental learning from transcripts/logs without storing labeled datasets, aligning with the after-action learning point.", "insertion": "Practical design choices that matter include: clear turn structure (front‑channel vs. back‑channel), explicit rules for information sharing and leaks, and rubrics that reward consistency and coalition‑building rather than only “wins.” Artifact capture (transcripts, proposals, dissent notes) is crucial for after‑action learning [@smith_memory_2021]. Reproducibility improves when scenarios, prompts, and adjudication criteria are shared alongside model/version information.", "fallback": "If moved, attach after the phrase 'after‑action learning' in the same paragraph."}
